Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
#include <Arduino.h>
#include "esp_camera.h"
#define CAMERA_MODEL_AI_THINKER
#include "camera_pins.h"
#include <WiFi.h>
#include <WebServer.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <ESP32Servo.h>
#include <time.h>
#include <math.h>

/*
  LogiGate - ESP32 gate controller
  Perfiles de hardware:
    - ESP32 DevKit (2 HC-SR04)
    - ESP32-CAM minimo (1 HC-SR04 + servo + boton)

  Nota ESP32-CAM minimo:
    - Usa un solo sensor fisico.
    - El cierre en automatico se hace por timeout seguro.
    - Ingreso/salida se define por estado en backend.

  Secuencia de paso esperada (ingreso):
    1) Sensor entrada ON
    2) Sensor entrada + salida ON
    3) Sensor entrada OFF
    4) Sensor salida OFF
    5) Cerrar barrera

  El mismo principio funciona al reves para salida:
    salida ON -> ambos ON -> salida OFF -> entrada OFF
*/

// -------------------- Runtime configuration --------------------
const char* WIFI_SSID = "Wifi iot";
const char* WIFI_PASSWORD = "111222333";

const char* FIREBASE_DB_URL = "https://stunning-logigate-default-rtdb.firebaseio.com";
const char* FIREBASE_API_KEY = "AIzaSyAJC6k0uwv9fIM7W0KOWaOjY00-BtIEWCU";
const char* FIREBASE_USER_EMAIL = "esp32@logigate.cl";
const char* FIREBASE_USER_PASSWORD = "logigateesp32"; 

const char* PLATE_RECOGNIZER_TOKEN = "080b98ac5ff98b0c09b952c4070dc946fe4e7616";
const char* PLATE_RECOGNIZER_REGION = "cl";

const char* DEVICE_ID = "ESP32-GATE-001";
const char* ACCESS_POINT = "porton_norte";
const char* DEVICE_NAME = "ESP32 Gate Controller Norte";
const char* FIRMWARE_VERSION = "v2.1.0";

// -------------------- Pin mapping --------------------
// 1 = ESP32-CAM minimo (recomendado si tu placa no expone GPIO23/22/21/19)
// 0 = ESP32 DevKit (2 sensores)
#define USE_ESP32_CAM_MINIMAL 1

#if USE_ESP32_CAM_MINIMAL
const int PIN_ENTRY_TRIG = 14;
const int PIN_ENTRY_ECHO = 15;
const int PIN_EXIT_TRIG = -1;
const int PIN_EXIT_ECHO = -1;
const int PIN_SERVO = 13;
const int PIN_MANUAL_BUTTON = 2;
const bool HAS_EXIT_SENSOR = false;
#else
const int PIN_ENTRY_TRIG = 23;
const int PIN_ENTRY_ECHO = 22;
const int PIN_EXIT_TRIG = 21;
const int PIN_EXIT_ECHO = 19;
const int PIN_SERVO = 18;
const int PIN_MANUAL_BUTTON = 5;
const bool HAS_EXIT_SENSOR = true;
#endif

// -------------------- Tuning --------------------
// Ajuste para maqueta pequena (deteccion cercana)
const float ENTRY_THRESHOLD_CM = 20.0f;
const float EXIT_THRESHOLD_CM = 20.0f;
const float MAX_VALID_DISTANCE_CM = 450.0f;
const float INVALID_DISTANCE_CM = 999.0f;

const uint8_t SENSOR_SAMPLES = 5;
const unsigned long SENSOR_POLL_MS = 180;
const unsigned long COMMAND_POLL_MS = 1100;
const unsigned long HEARTBEAT_MS = 5000;
const unsigned long WIFI_RECONNECT_MS = 6000;
const unsigned long BUTTON_DEBOUNCE_MS = 80;
const unsigned long CROSSING_TIMEOUT_MS = 9000;
const unsigned long OPEN_FAILSAFE_MS = 15000;
const unsigned long HTTP_TIMEOUT_MS = 7000;
const unsigned long RETRY_BASE_MS = 1800;
const uint8_t MAX_RETRY_ATTEMPTS = 8;
const uint8_t FIREBASE_REQUEST_MAX_ATTEMPTS = 3;
const unsigned long FIREBASE_REQUEST_RETRY_MS = 1200;
const unsigned long ECHO_TIMEOUT_US = 30000;
const unsigned long FIREBASE_TOKEN_REFRESH_MARGIN_MS = 120000;
const unsigned long FIREBASE_AUTH_RETRY_MS = 8000;
const unsigned long FIREBASE_AUTH_LOCK_BASE_MS = 60000;
const unsigned long FIREBASE_AUTH_LOCK_MAX_MS = 900000;
const bool ENABLE_NTP_SYNC = false;
const bool DEBUG_DISTANCE_LOG = true;
const unsigned long DEBUG_DISTANCE_LOG_MS = 1000;
const bool DEBUG_SERVO_FLOW = true;
const bool SERVO_TEST_ON_PHOTO_CAPTURE = true;
const bool START_IN_MANUAL_FISICO = false;
const size_t MAX_PLATE_API_RESPONSE_STORED = 1200;
const size_t MAX_FIREBASE_ERROR_BODY_LOG = 300;
const framesize_t CAMERA_FRAME_SIZE_PSRAM = FRAMESIZE_SVGA;     // 800x600
const framesize_t CAMERA_FRAME_SIZE_NO_PSRAM = FRAMESIZE_VGA;   // 640x480
const int CAMERA_JPEG_QUALITY = 10;                             // Menor numero = mejor calidad
const uint8_t CAMERA_FB_COUNT_PSRAM = 2;
const uint8_t CAMERA_FB_COUNT_NO_PSRAM = 1;
const bool ENABLE_PREVIEW_SERVER = true;
const uint16_t PREVIEW_SERVER_PORT = 80;
const size_t MAX_PREVIEW_JPEG_BYTES = 350 * 1024;
const unsigned long PREVIEW_BEFORE_UPLOAD_DELAY_MS = 0;

const int SERVO_OPEN_ANGLE = 92;
const int SERVO_CLOSED_ANGLE = 8;
const bool SERVO_SMOOTH_MOVE = true;
const int SERVO_STEP_DEG = 2;
const unsigned long SERVO_STEP_DELAY_MS = 15;
const bool SERVO_DETACH_WHEN_IDLE = true;
const unsigned long SERVO_SETTLE_MS = 120;

Servo barrierServo;
int servoCurrentAngle = SERVO_CLOSED_ANGLE;
WebServer previewServer(PREVIEW_SERVER_PORT);
bool previewServerStarted = false;
uint8_t* lastPreviewJpeg = nullptr;
size_t lastPreviewJpegLen = 0;
unsigned long lastPreviewCapturedAt = 0;

enum PassageDirection {
  DIR_NONE = 0,
  DIR_INGRESO = 1,
  DIR_SALIDA = 2,
};

enum PassageState {
  SEQ_IDLE = 0,
  SEQ_FIRST_ACTIVE = 1,
  SEQ_BOTH_ACTIVE = 2,
  SEQ_FIRST_RELEASED = 3,
};

struct DetectionQueueItem {
  bool pending = false;
  String eventId;
  String payload;
  uint8_t attempts = 0;
  unsigned long nextRetryAt = 0;
};

DetectionQueueItem detectionQueue;
DetectionQueueItem plateReadingQueue;

String barrierMode = START_IN_MANUAL_FISICO ? "manual_fisico" : "automatico";
String barrierStatus = "cerrada";
String lastCommandRequestId = "";
unsigned long barrierOpenedAtMs = 0;

float entryDistanceCm = INVALID_DISTANCE_CM;
float exitDistanceCm = INVALID_DISTANCE_CM;
bool entryActive = false;
bool exitActive = false;
bool prevEntryActive = false;
bool prevExitActive = false;

PassageDirection crossingDirection = DIR_NONE;
PassageState crossingState = SEQ_IDLE;
unsigned long crossingStateStartedAt = 0;

unsigned long lastSensorPollAt = 0;
unsigned long lastCommandPollAt = 0;
unsigned long lastHeartbeatAt = 0;
unsigned long lastWifiCheckAt = 0;
unsigned long lastNtpSyncAt = 0;
unsigned long lastDistanceLogAt = 0;

String firebaseIdToken = "";
String firebaseRefreshToken = "";
unsigned long firebaseTokenRefreshAt = 0;
unsigned long lastFirebaseAuthAttemptAt = 0;
unsigned long firebaseAuthLockedUntil = 0;
unsigned long firebaseAuthLockMs = FIREBASE_AUTH_LOCK_BASE_MS;

int buttonLastReading = HIGH;
int buttonStableState = HIGH;
unsigned long buttonLastDebounceAt = 0;

bool cameraReady = false;
unsigned long lastCaptureAt = 0;
const unsigned long CAPTURE_COOLDOWN_MS = 3000;

// -------------------- Forward declarations --------------------
bool isWifiConnected();
void clearDetectionQueue();
void clearPlateReadingQueue();
void flushPlateReadingQueue();
void connectWifi();
void setupHardware();
void setupConnectivityAndAuth();
void setupPreviewServerIfNeeded();
void runPreviewServerTask();
void handlePreviewRoot();
void handlePreviewJpeg();
void cacheLastPreviewFrame(camera_fb_t* fb);
void clearLastPreviewFrame();
void runConnectivityTask();
void runSensorTask();
void runCommandTask();
void openBarrier(const char* actor, const char* reason);
void moveServoToAngle(int targetAngle);
bool sendPhotoToPlateRecognizer(camera_fb_t* fb, String& responseBodyOut, int& httpCodeOut);
bool extractPlateRecognition(const String& responseBody, String& plateOut, float& scoreOut, float& confidenceOut, String& regionOut);
String clipForStorage(const String& input, size_t maxLen);
bool firebaseRequest(
  const String& method,
  const String& path,
  const String& payload,
  String* responseOut = nullptr,
  int* statusCodeOut = nullptr
);
bool firebaseGet(const String& path, String& response);
bool firebasePut(const String& path, const String& payload);
bool firebasePatch(const String& path, const String& payload);
void persistPlateRecognitionResult(
  const char* trigger,
  bool requestOk,
  int httpCode,
  const String& responseBody,
  bool hasPlate,
  const String& plate,
  float score,
  float confidence,
  const String& region
);

