Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
// -------------------- Camera --------------------
bool initCamera() {
#if USE_ESP32_CAM_MINIMAL
  bool hasPsram = psramFound();
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
#else
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
#endif
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = hasPsram ? CAMERA_FRAME_SIZE_PSRAM : CAMERA_FRAME_SIZE_NO_PSRAM;
  config.jpeg_quality = CAMERA_JPEG_QUALITY;
  config.fb_count = hasPsram ? CAMERA_FB_COUNT_PSRAM : CAMERA_FB_COUNT_NO_PSRAM;
#if defined(CAMERA_GRAB_WHEN_EMPTY)
  config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
#endif
#if defined(CAMERA_FB_IN_PSRAM)
  config.fb_location = CAMERA_FB_IN_PSRAM;
#endif

  if (!hasPsram) {
    config.frame_size = CAMERA_FRAME_SIZE_NO_PSRAM;
    config.fb_count = CAMERA_FB_COUNT_NO_PSRAM;
#if defined(CAMERA_FB_IN_DRAM)
    config.fb_location = CAMERA_FB_IN_DRAM;
#endif
  }

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("Camera init failed: 0x%x\n", err);
    return false;
  }

  sensor_t* s = esp_camera_sensor_get();
  if (s) {
    // Ajuste recomendado para OV3660 en ESP32-CAM AI Thinker.
    if (s->id.PID == OV3660_PID) {
      s->set_vflip(s, 1);
      s->set_brightness(s, 0);
      s->set_saturation(s, 0);
    }
    s->set_framesize(s, hasPsram ? CAMERA_FRAME_SIZE_PSRAM : CAMERA_FRAME_SIZE_NO_PSRAM);
    s->set_quality(s, CAMERA_JPEG_QUALITY);
    s->set_brightness(s, 0);
    s->set_contrast(s, 1);
    s->set_saturation(s, 0);
  }

  Serial.println("Camera ready");
  return true;
#else
  return false;
#endif
}

void capturePhoto(const char* trigger) {
#if USE_ESP32_CAM_MINIMAL
  if (!cameraReady) return;

  if (millis() - lastCaptureAt < CAPTURE_COOLDOWN_MS) {
    return;
  }

  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("Capture failed");
    return;
  }

  Serial.printf("Foto capturada | trigger=%s | bytes=%u | %ux%u\n",
                trigger, fb->len, fb->width, fb->height);

  cacheLastPreviewFrame(fb);
  if (ENABLE_PREVIEW_SERVER && PREVIEW_BEFORE_UPLOAD_DELAY_MS > 0 && isWifiConnected()) {
    Serial.printf("[PREVIEW] inspeccion previa %lums en http://%s:%u/\n",
                  PREVIEW_BEFORE_UPLOAD_DELAY_MS,
                  WiFi.localIP().toString().c_str(),
                  PREVIEW_SERVER_PORT);
    delay(PREVIEW_BEFORE_UPLOAD_DELAY_MS);
  }

  String plateApiResponse;
  int plateApiHttpCode = 0;
  bool plateRequestOk = sendPhotoToPlateRecognizer(fb, plateApiResponse, plateApiHttpCode);

  String plate = "";
  float score = 0.0f;
  float confidence = 0.0f;
  String region = "";
  bool hasPlate = extractPlateRecognition(plateApiResponse, plate, score, confidence, region);

  if (plateRequestOk) {
    if (hasPlate) {
      Serial.printf("[PLATE] patente_identificada_correctamente plate=%s score=%.3f confidence=%.3f region=%s\n",
                    plate.c_str(), score, confidence, region.c_str());
    } else {
      Serial.println("[PLATE] no_existe_patente_en_foto");
    }
  } else {
    Serial.printf("[PLATE] error_consulta_plate_recognizer httpCode=%d\n", plateApiHttpCode);
  }

  persistPlateRecognitionResult(
    trigger,
    plateRequestOk,
    plateApiHttpCode,
    plateApiResponse,
    hasPlate,
    plate,
    score,
    confidence,
    region
  );

  esp_camera_fb_return(fb);
  lastCaptureAt = millis();

  if (SERVO_TEST_ON_PHOTO_CAPTURE) {
    openBarrier("photo_test", "Photo captured trigger");
  }
#else
  (void)trigger;
#endif
}

// -------------------- Utilities --------------------
String nowIsoUtc() {
  time_t now = time(nullptr);
  if (now < 1700000000) {
    return String("1970-01-01T00:00:00Z");
  }

  struct tm timeInfo;
  gmtime_r(&now, &timeInfo);
  char buffer[25];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%SZ", &timeInfo);
  return String(buffer);
}

long long nowEpochMs() {
  time_t now = time(nullptr);
  if (now < 1700000000) {
    return 0;
  }
  return static_cast<long long>(now) * 1000LL;
}

bool isWifiConnected() {
  return WiFi.status() == WL_CONNECTED;
}

void clearLastPreviewFrame() {
  if (lastPreviewJpeg != nullptr) {
    free(lastPreviewJpeg);
    lastPreviewJpeg = nullptr;
  }
  lastPreviewJpegLen = 0;
}

void cacheLastPreviewFrame(camera_fb_t* fb) {
  if (fb == nullptr) return;

  if (fb->len == 0 || fb->len > MAX_PREVIEW_JPEG_BYTES) {
    if (fb->len > MAX_PREVIEW_JPEG_BYTES) {
      Serial.printf("[PREVIEW] captura demasiado grande para cache: %u bytes (max %u)\n",
                    static_cast<unsigned int>(fb->len),
                    static_cast<unsigned int>(MAX_PREVIEW_JPEG_BYTES));
    }
    return;
  }

  uint8_t* copyBuffer = static_cast<uint8_t*>(malloc(fb->len));
  if (copyBuffer == nullptr) {
    Serial.println("[PREVIEW] sin memoria para cachear captura");
    return;
  }

  memcpy(copyBuffer, fb->buf, fb->len);
  clearLastPreviewFrame();
  lastPreviewJpeg = copyBuffer;
  lastPreviewJpegLen = fb->len;
  lastPreviewCapturedAt = millis();
}

void handlePreviewJpeg() {
  if (!cameraReady) {
    previewServer.send(503, "text/plain", "camera_not_ready");
    return;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0;
  camera_fb_t* liveFb = nullptr;

  if (lastPreviewJpeg != nullptr && lastPreviewJpegLen > 0) {
    payload = lastPreviewJpeg;
    payloadLen = lastPreviewJpegLen;
  } else {
    liveFb = esp_camera_fb_get();
    if (liveFb == nullptr) {
      previewServer.send(500, "text/plain", "capture_failed");
      return;
    }
    payload = liveFb->buf;
    payloadLen = liveFb->len;
  }

