Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
  previewServer.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate");
  previewServer.sendHeader("Pragma", "no-cache");
  previewServer.sendHeader("Expires", "0");
  previewServer.setContentLength(payloadLen);
  previewServer.send(200, "image/jpeg", "");
  previewServer.client().write(payload, payloadLen);

  if (liveFb != nullptr) {
    esp_camera_fb_return(liveFb);
  }
}

void handlePreviewRoot() {
  String html;
  html.reserve(700);
  html += "<!doctype html><html><head><meta charset='utf-8'>";
  html += "<meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>ESP32 Preview</title>";
  html += "<style>body{font-family:Arial;margin:16px;background:#f5f7fb;color:#111}img{max-width:100%;height:auto;border:1px solid #ccc;border-radius:8px;background:#fff}button{margin-top:10px;padding:8px 12px;border:0;border-radius:6px;background:#0b63f6;color:#fff}code{background:#eee;padding:2px 6px;border-radius:4px}</style>";
  html += "</head><body>";
  html += "<h2>Preview ESP32-CAM</h2>";
  html += "<p>Endpoint imagen: <code>/preview.jpg</code></p>";
  html += "<img id='img' src='/preview.jpg?t=" + String(millis()) + "' alt='preview'>";
  html += "<br><button onclick='reloadImg()'>Actualizar</button>";
  html += "<script>function reloadImg(){document.getElementById('img').src='/preview.jpg?t='+Date.now();}setInterval(reloadImg,1500);</script>";
  html += "</body></html>";
  previewServer.send(200, "text/html", html);
}

void setupPreviewServerIfNeeded() {
  if (!ENABLE_PREVIEW_SERVER) return;
  if (previewServerStarted) return;
  if (!isWifiConnected()) return;

  previewServer.on("/", HTTP_GET, handlePreviewRoot);
  previewServer.on("/preview.jpg", HTTP_GET, handlePreviewJpeg);
  previewServer.begin();
  previewServerStarted = true;

  Serial.printf("[PREVIEW] servidor activo en http://%s:%u/\n",
                WiFi.localIP().toString().c_str(),
                PREVIEW_SERVER_PORT);
}

void runPreviewServerTask() {
  if (!ENABLE_PREVIEW_SERVER) return;
  if (!previewServerStarted) {
    setupPreviewServerIfNeeded();
    return;
  }
  previewServer.handleClient();
}

int wifiSignalPercent() {
  long rssi = WiFi.RSSI();
  if (rssi <= -100) return 0;
  if (rssi >= -50) return 100;
  return static_cast<int>(2 * (rssi + 100));
}

const char* directionToString(PassageDirection dir) {
  if (dir == DIR_INGRESO) return "ingreso";
  if (dir == DIR_SALIDA) return "salida";
  return "none";
}

const char* sequenceStateToString(PassageState state) {
  if (state == SEQ_FIRST_ACTIVE) return "first_sensor_active";
  if (state == SEQ_BOTH_ACTIVE) return "both_sensors_active";
  if (state == SEQ_FIRST_RELEASED) return "first_sensor_released";
  return "idle";
}

bool millisReached(unsigned long targetAt) {
  return static_cast<long>(millis() - targetAt) >= 0;
}

unsigned long parseExpiresInSeconds(const JsonVariantConst& value) {
  if (value.is<const char*>()) {
    return strtoul(value.as<const char*>(), nullptr, 10);
  }
  if (value.is<unsigned long>()) {
    return value.as<unsigned long>();
  }
  if (value.is<long>()) {
    long parsed = value.as<long>();
    return parsed > 0 ? static_cast<unsigned long>(parsed) : 0;
  }
  return 0;
}

void scheduleFirebaseTokenRefresh(unsigned long expiresInSeconds) {
  unsigned long expiresMs = expiresInSeconds * 1000UL;
  if (expiresMs <= FIREBASE_TOKEN_REFRESH_MARGIN_MS) {
    firebaseTokenRefreshAt = millis() + 1000UL;
    return;
  }
  firebaseTokenRefreshAt = millis() + (expiresMs - FIREBASE_TOKEN_REFRESH_MARGIN_MS);
}

String urlEncode(const String& input) {
  String encoded;
  encoded.reserve(input.length() * 3);
  const char* hex = "0123456789ABCDEF";

  for (size_t i = 0; i < input.length(); i++) {
    uint8_t c = static_cast<uint8_t>(input[i]);
    bool isSafe =
      (c >= 'a' && c <= 'z') ||
      (c >= 'A' && c <= 'Z') ||
      (c >= '0' && c <= '9') ||
      c == '-' || c == '_' || c == '.' || c == '~';

    if (isSafe) {
      encoded += static_cast<char>(c);
    } else {
      encoded += '%';
      encoded += hex[(c >> 4) & 0x0F];
      encoded += hex[c & 0x0F];
    }
  }
  return encoded;
}

String clipForStorage(const String& input, size_t maxLen) {
  if (input.length() <= maxLen) {
    return input;
  }
  return input.substring(0, maxLen);
}

bool sendPhotoToPlateRecognizer(camera_fb_t* fb, String& responseBodyOut, int& httpCodeOut) {
  responseBodyOut = "";
  httpCodeOut = 0;

  if (!isWifiConnected()) {
    return false;
  }

  if (strlen(PLATE_RECOGNIZER_TOKEN) == 0 || String(PLATE_RECOGNIZER_TOKEN) == "REEMPLAZAR_POR_TOKEN_REAL") {
    Serial.println("[PLATE] token no configurado");
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(HTTP_TIMEOUT_MS);

  const char* host = "api.platerecognizer.com";
  const uint16_t port = 443;
  if (!client.connect(host, port)) {
    Serial.println("[PLATE] fallo conexion HTTPS");
    return false;
  }

  String boundary = "----logigate-" + String(static_cast<uint32_t>(esp_random()), HEX);
  String partRegion =
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"regions\"\r\n\r\n" + String(PLATE_RECOGNIZER_REGION) + "\r\n";
  String partFileHeader =
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"upload\"; filename=\"capture.jpg\"\r\n"
    "Content-Type: image/jpeg\r\n\r\n";
  String partFileFooter = "\r\n--" + boundary + "--\r\n";

  size_t contentLength = partRegion.length() + partFileHeader.length() + fb->len + partFileFooter.length();

  client.print("POST /v1/plate-reader/ HTTP/1.1\r\n");
  client.print("Host: api.platerecognizer.com\r\n");
  client.print("Authorization: Token ");
  client.print(PLATE_RECOGNIZER_TOKEN);
  client.print("\r\n");
  client.print("Content-Type: multipart/form-data; boundary=");
  client.print(boundary);
  client.print("\r\n");
  client.print("Content-Length: ");
  client.print(contentLength);
  client.print("\r\n");
  client.print("Connection: close\r\n\r\n");

  client.print(partRegion);
  client.print(partFileHeader);
  size_t bytesWritten = client.write(fb->buf, fb->len);
  client.print(partFileFooter);
  client.flush();

