Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
  if (bytesWritten != fb->len) {
    Serial.printf("[PLATE] envio incompleto bytes=%u/%u\n",
                  static_cast<unsigned int>(bytesWritten),
                  static_cast<unsigned int>(fb->len));
    client.stop();
    return false;
  }

  unsigned long waitStart = millis();
  while (!client.available() && client.connected() && (millis() - waitStart < HTTP_TIMEOUT_MS)) {
    delay(10);
  }

  String rawResponse = "";
  while (client.connected() || client.available()) {
    String chunk = client.readString();
    if (chunk.length() == 0) {
      break;
    }
    rawResponse += chunk;
  }
  client.stop();

  int statusLineEnd = rawResponse.indexOf("\r\n");
  if (statusLineEnd < 0) {
    return false;
  }

  String statusLine = rawResponse.substring(0, statusLineEnd);
  int firstSpace = statusLine.indexOf(' ');
  int secondSpace = statusLine.indexOf(' ', firstSpace + 1);
  if (firstSpace < 0 || secondSpace < 0) {
    return false;
  }

  httpCodeOut = statusLine.substring(firstSpace + 1, secondSpace).toInt();

  int bodyStart = rawResponse.indexOf("\r\n\r\n");
  if (bodyStart >= 0) {
    responseBodyOut = rawResponse.substring(bodyStart + 4);
  } else {
    responseBodyOut = "";
  }

  return (httpCodeOut >= 200 && httpCodeOut < 300);
}

bool extractPlateRecognition(const String& responseBody, String& plateOut, float& scoreOut, float& confidenceOut, String& regionOut) {
  plateOut = "";
  scoreOut = 0.0f;
  confidenceOut = 0.0f;
  regionOut = "";

  if (responseBody.length() == 0) {
    return false;
  }

  StaticJsonDocument<4096> doc;
  DeserializationError err = deserializeJson(doc, responseBody);
  if (err != DeserializationError::Ok) {
    return false;
  }

  JsonArray results = doc["results"].as<JsonArray>();
  if (results.isNull() || results.size() == 0) {
    return false;
  }

  JsonObject first = results[0];
  plateOut = String(first["plate"] | "");
  scoreOut = first["score"] | 0.0f;
  confidenceOut = first["dscore"] | 0.0f;
  regionOut = String(first["region"]["code"] | "");

  return plateOut.length() > 0;
}

void persistPlateRecognitionResult(
  const char* trigger,
  bool requestOk,
  int httpCode,
  const String& responseBody,
  bool hasPlate,
  const String& plate,
  float score,
  float confidence,
  const String& region
) {
  String eventId = String(DEVICE_ID) + "-pr-" + String(millis()) + "-" + String(static_cast<uint32_t>(esp_random()), HEX);
  String recognitionStatusCode;
  String recognitionStatusMessage;

  if (!requestOk) {
    recognitionStatusCode = "error_consulta_plate_recognizer";
    recognitionStatusMessage = "Error consultando Plate Recognizer";
  } else if (hasPlate) {
    recognitionStatusCode = "patente_identificada_correctamente";
    recognitionStatusMessage = "La patente se identifico correctamente";
  } else {
    recognitionStatusCode = "no_existe_patente_en_foto";
    recognitionStatusMessage = "No existe patente en foto";
  }

  StaticJsonDocument<4096> doc;
  doc["deviceId"] = DEVICE_ID;
  doc["accessPoint"] = ACCESS_POINT;
  doc["trigger"] = trigger;
  doc["capturedAt"] = nowIsoUtc();
  doc["capturedAtEpochMs"] = nowEpochMs();
  JsonObject capturedAtServer = doc.createNestedObject("capturedAtServer");
  capturedAtServer[".sv"] = "timestamp";

  doc["requestOk"] = requestOk;
  doc["httpCode"] = httpCode;
  doc["hasPlate"] = hasPlate;
  doc["plate"] = plate;
  doc["score"] = score;
  doc["confidence"] = confidence;
  doc["region"] = region;
  doc["recognitionStatusCode"] = recognitionStatusCode;
  doc["recognitionStatusMessage"] = recognitionStatusMessage;

  doc["entryDistanceCm"] = entryDistanceCm;
  doc["exitDistanceCm"] = exitDistanceCm;
  doc["entrySensorActive"] = entryActive;
  doc["exitSensorActive"] = exitActive;
  doc["mode"] = barrierMode;
  doc["barrierStatus"] = barrierStatus;

  doc["plateApiRaw"] = clipForStorage(responseBody, MAX_PLATE_API_RESPONSE_STORED);

  String payload;
  serializeJson(doc, payload);

  // Usa cola/reintento para evitar perder lecturas por fallas transitorias (token/WiFi/http=-1).
  if (!plateReadingQueue.pending) {
    plateReadingQueue.pending = true;
    plateReadingQueue.eventId = eventId;
    plateReadingQueue.payload = payload;
    plateReadingQueue.attempts = 0;
    plateReadingQueue.nextRetryAt = millis();
  } else {
    Serial.printf("[PLATE] cola ocupada, se prioriza evento pendiente id=%s\n",
                  plateReadingQueue.eventId.c_str());
  }

  flushPlateReadingQueue();

  if (plateReadingQueue.pending && plateReadingQueue.eventId == eventId) {
    Serial.printf("[PLATE] guardado pendiente en cola (path=ingest/plate_readings/%s)\n", eventId.c_str());
  }
}

void logServoFlow(const char* phase, const char* actor, const char* reason) {
  if (!DEBUG_SERVO_FLOW) return;
  Serial.printf("[SERVO] %s | actor=%s | reason=%s | mode=%s | status=%s | entryAct=%d | exitAct=%d\n",
                phase,
                actor,
                reason,
                barrierMode.c_str(),
                barrierStatus.c_str(),
                entryActive ? 1 : 0,
                exitActive ? 1 : 0);
}

void moveServoToAngle(int targetAngle) {
  targetAngle = constrain(targetAngle, 0, 180);

  if (!barrierServo.attached()) {
    barrierServo.attach(PIN_SERVO);
  }

  if (!SERVO_SMOOTH_MOVE) {
    barrierServo.write(targetAngle);
    servoCurrentAngle = targetAngle;
  } else {
    int startAngle = servoCurrentAngle;
    if (startAngle == targetAngle) {
      barrierServo.write(targetAngle);
    } else {
      int direction = (targetAngle > startAngle) ? 1 : -1;
      int step = max(1, SERVO_STEP_DEG);
      int angle = startAngle;
      while (angle != targetAngle) {
        angle += direction * step;
        if ((direction > 0 && angle > targetAngle) || (direction < 0 && angle < targetAngle)) {
          angle = targetAngle;
        }
        barrierServo.write(angle);
        servoCurrentAngle = angle;
        delay(SERVO_STEP_DELAY_MS);
      }
    }
  }

  delay(SERVO_SETTLE_MS);
  if (SERVO_DETACH_WHEN_IDLE) {
    barrierServo.detach();
  }
}

// -------------------- Firebase REST auth/data --------------------
bool firebaseAuthIsLocked() {
  if (firebaseAuthLockedUntil == 0) {
    return false;
  }
  if (millisReached(firebaseAuthLockedUntil)) {
    firebaseAuthLockedUntil = 0;
    return false;
  }
  return true;
}

void setFirebaseAuthLock(unsigned long lockMs, const char* reason) {
  if (lockMs < FIREBASE_AUTH_LOCK_BASE_MS) {
    lockMs = FIREBASE_AUTH_LOCK_BASE_MS;
  }
  if (lockMs > FIREBASE_AUTH_LOCK_MAX_MS) {
    lockMs = FIREBASE_AUTH_LOCK_MAX_MS;
  }
  firebaseAuthLockMs = lockMs;
  firebaseAuthLockedUntil = millis() + lockMs;
  Serial.printf("[AUTH] lock activado por %lu ms (%s)\n", lockMs, reason);
}

void escalateFirebaseAuthLock(const char* reason) {
  unsigned long nextLockMs = firebaseAuthLockMs;
  if (nextLockMs < FIREBASE_AUTH_LOCK_BASE_MS) {
    nextLockMs = FIREBASE_AUTH_LOCK_BASE_MS;
  }
  if (nextLockMs < FIREBASE_AUTH_LOCK_MAX_MS) {
    nextLockMs = min(FIREBASE_AUTH_LOCK_MAX_MS, nextLockMs * 2UL);
  }
  setFirebaseAuthLock(nextLockMs, reason);
}

bool firebaseSignInWithEmailPassword() {
  if (!isWifiConnected()) {
    Serial.println("[AUTH] signIn cancelado: WiFi no conectado");
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.setTimeout(HTTP_TIMEOUT_MS);

  String url = "https://identitytoolkit.googleapis.com/v1/accounts:signInWithPassword?key=" + String(FIREBASE_API_KEY);
  if (!http.begin(client, url)) {
    Serial.println("[AUTH] signIn cancelado: http.begin fallo");
    return false;
  }

  http.addHeader("Content-Type", "application/json");
  StaticJsonDocument<256> payloadDoc;
  payloadDoc["email"] = FIREBASE_USER_EMAIL;
  payloadDoc["password"] = FIREBASE_USER_PASSWORD;
  payloadDoc["returnSecureToken"] = true;

  String payload;
  serializeJson(payloadDoc, payload);

