Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
  int code = http.POST(payload);
  String response = http.getString();
  http.end();

  if (code < 200 || code >= 300) {
    Serial.printf("[AUTH] signIn HTTP %d body=%s\n",
                  code,
                  clipForStorage(response, MAX_FIREBASE_ERROR_BODY_LOG).c_str());
    if (response.indexOf("TOO_MANY_ATTEMPTS_TRY_LATER") >= 0) {
      escalateFirebaseAuthLock("TOO_MANY_ATTEMPTS_TRY_LATER");
    } else if (response.indexOf("INVALID_LOGIN_CREDENTIALS") >= 0 ||
               response.indexOf("INVALID_PASSWORD") >= 0 ||
               response.indexOf("EMAIL_NOT_FOUND") >= 0 ||
               response.indexOf("USER_DISABLED") >= 0) {
      setFirebaseAuthLock(FIREBASE_AUTH_LOCK_MAX_MS, "credenciales invalidas o usuario deshabilitado");
    }
    return false;
  }

  StaticJsonDocument<2048> doc;
  if (deserializeJson(doc, response) != DeserializationError::Ok) {
    Serial.println("[AUTH] signIn respuesta JSON invalida");
    return false;
  }

  String idToken = doc["idToken"] | "";
  String refreshToken = doc["refreshToken"] | "";
  if (idToken.length() == 0 || refreshToken.length() == 0) {
    return false;
  }

  firebaseIdToken = idToken;
  firebaseRefreshToken = refreshToken;
  unsigned long expiresInSeconds = parseExpiresInSeconds(doc["expiresIn"]);
  scheduleFirebaseTokenRefresh(expiresInSeconds);
  firebaseAuthLockedUntil = 0;
  firebaseAuthLockMs = FIREBASE_AUTH_LOCK_BASE_MS;
  Serial.printf("[AUTH] signIn ok expiresIn=%lu\n", expiresInSeconds);
  return true;
}

bool firebaseRefreshIdToken() {
  if (!isWifiConnected()) {
    Serial.println("[AUTH] refresh cancelado: WiFi no conectado");
    return false;
  }
  if (firebaseRefreshToken.length() == 0) {
    Serial.println("[AUTH] refresh cancelado: refresh_token vacio");
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.setTimeout(HTTP_TIMEOUT_MS);

  String url = "https://securetoken.googleapis.com/v1/token?key=" + String(FIREBASE_API_KEY);
  if (!http.begin(client, url)) {
    Serial.println("[AUTH] refresh cancelado: http.begin fallo");
    return false;
  }

  http.addHeader("Content-Type", "application/x-www-form-urlencoded");
  String body = "grant_type=refresh_token&refresh_token=" + urlEncode(firebaseRefreshToken);
  int code = http.POST(body);
  String response = http.getString();
  http.end();

  if (code < 200 || code >= 300) {
    Serial.printf("[AUTH] refresh HTTP %d body=%s\n",
                  code,
                  clipForStorage(response, MAX_FIREBASE_ERROR_BODY_LOG).c_str());
    if (response.indexOf("TOO_MANY_ATTEMPTS_TRY_LATER") >= 0) {
      escalateFirebaseAuthLock("refresh TOO_MANY_ATTEMPTS_TRY_LATER");
    }
    return false;
  }

  StaticJsonDocument<2048> doc;
  if (deserializeJson(doc, response) != DeserializationError::Ok) {
    Serial.println("[AUTH] refresh respuesta JSON invalida");
    return false;
  }

  String idToken = doc["id_token"] | "";
  String refreshToken = doc["refresh_token"] | "";
  if (idToken.length() == 0 || refreshToken.length() == 0) {
    return false;
  }

  firebaseIdToken = idToken;
  firebaseRefreshToken = refreshToken;
  unsigned long expiresInSeconds = parseExpiresInSeconds(doc["expires_in"]);
  scheduleFirebaseTokenRefresh(expiresInSeconds);
  firebaseAuthLockedUntil = 0;
  firebaseAuthLockMs = FIREBASE_AUTH_LOCK_BASE_MS;
  Serial.printf("[AUTH] refresh ok expiresIn=%lu\n", expiresInSeconds);
  return true;
}

bool ensureFirebaseIdToken() {
  if (!isWifiConnected()) return false;
  if (firebaseAuthIsLocked()) return false;

  if (firebaseIdToken.length() == 0) {
    if (millis() - lastFirebaseAuthAttemptAt < FIREBASE_AUTH_RETRY_MS) {
      return false;
    }
    lastFirebaseAuthAttemptAt = millis();
    return firebaseSignInWithEmailPassword();
  }

  if (firebaseTokenRefreshAt == 0 || millisReached(firebaseTokenRefreshAt)) {
    if (firebaseRefreshIdToken()) {
      return true;
    }
    firebaseIdToken = "";
    firebaseTokenRefreshAt = 0;
    if (millis() - lastFirebaseAuthAttemptAt < FIREBASE_AUTH_RETRY_MS) {
      return false;
    }
    lastFirebaseAuthAttemptAt = millis();
    return firebaseSignInWithEmailPassword();
  }

  return true;
}

String firebaseDbUrl(const String& path) {
  String base = String(FIREBASE_DB_URL);
  if (base.endsWith("/")) {
    base.remove(base.length() - 1);
  }
  return base + "/" + path + ".json?auth=" + firebaseIdToken;
}

bool firebaseRequest(const String& method, const String& path, const String& payload, String* responseOut, int* statusCodeOut) {
  if (statusCodeOut != nullptr) {
    *statusCodeOut = -1;
  }
  if (responseOut != nullptr) {
    *responseOut = "";
  }

  for (uint8_t attempt = 0; attempt < FIREBASE_REQUEST_MAX_ATTEMPTS; attempt++) {
    if (!isWifiConnected()) {
      connectWifi();
      if (!isWifiConnected()) {
        if (attempt < (FIREBASE_REQUEST_MAX_ATTEMPTS - 1)) {
          delay(FIREBASE_REQUEST_RETRY_MS * (attempt + 1));
          continue;
        }
        Serial.printf("[FIREBASE] %s %s cancelado: WiFi no conectado\n", method.c_str(), path.c_str());
        return false;
      }
    }

    if (!ensureFirebaseIdToken()) {
      if (firebaseAuthIsLocked()) {
        Serial.printf("[FIREBASE] %s %s cancelado: auth en cooldown\n", method.c_str(), path.c_str());
        return false;
      }
      if (attempt < (FIREBASE_REQUEST_MAX_ATTEMPTS - 1)) {
        delay(FIREBASE_REQUEST_RETRY_MS * (attempt + 1));
        continue;
      }
      Serial.printf("[FIREBASE] %s %s cancelado: token no disponible\n", method.c_str(), path.c_str());
      return false;
    }

    WiFiClientSecure client;
    client.setInsecure();

    HTTPClient http;
    http.setTimeout(HTTP_TIMEOUT_MS);

    if (!http.begin(client, firebaseDbUrl(path))) {
      Serial.printf("[FIREBASE] %s %s cancelado: http.begin fallo (heap=%u)\n",
                    method.c_str(),
                    path.c_str(),
                    static_cast<unsigned>(ESP.getFreeHeap()));
      if (statusCodeOut != nullptr) {
        *statusCodeOut = -1;
      }
      if (attempt < (FIREBASE_REQUEST_MAX_ATTEMPTS - 1)) {
        delay(FIREBASE_REQUEST_RETRY_MS * (attempt + 1));
        continue;
      }
      return false;
    }

    int code = -1;
    if (method == "GET") {
      code = http.GET();
    } else if (method == "PUT") {
      http.addHeader("Content-Type", "application/json");
      code = http.PUT(payload);
    } else if (method == "PATCH") {
      http.addHeader("Content-Type", "application/json");
      code = http.sendRequest("PATCH", payload);
    } else if (method == "POST") {
      http.addHeader("Content-Type", "application/json");
      code = http.POST(payload);
    }

    String response = http.getString();
    http.end();

    if (statusCodeOut != nullptr) {
      *statusCodeOut = code;
    }

    if (responseOut != nullptr) {
      *responseOut = response;
    }

    if (code < 0) {
      String errTxt = HTTPClient::errorToString(code);
      Serial.printf("[FIREBASE] %s %s transporte error=%d (%s)\n",
                    method.c_str(),
                    path.c_str(),
                    code,
                    errTxt.c_str());
      if (attempt < (FIREBASE_REQUEST_MAX_ATTEMPTS - 1)) {
        delay(FIREBASE_REQUEST_RETRY_MS * (attempt + 1));
        continue;
      }
      return false;
    }

    if (code == 401 && attempt < (FIREBASE_REQUEST_MAX_ATTEMPTS - 1)) {
      firebaseTokenRefreshAt = 0;
      if (!firebaseRefreshIdToken()) {
        firebaseIdToken = "";
      }
      continue;
    }

    bool ok = (code >= 200 && code < 300);
    if (!ok) {
      Serial.printf("[FIREBASE] %s %s -> HTTP %d body=%s\n",
                    method.c_str(),
                    path.c_str(),
                    code,
                    clipForStorage(response, MAX_FIREBASE_ERROR_BODY_LOG).c_str());
      if (code >= 500 && attempt < (FIREBASE_REQUEST_MAX_ATTEMPTS - 1)) {
        delay(FIREBASE_REQUEST_RETRY_MS * (attempt + 1));
        continue;
      }
    }

    return ok;
  }

