Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
  return false;
}

bool firebaseGet(const String& path, String& response) {
  return firebaseRequest("GET", path, "", &response);
}

bool firebasePut(const String& path, const String& payload) {
  return firebaseRequest("PUT", path, payload, nullptr);
}

bool firebasePatch(const String& path, const String& payload) {
  return firebaseRequest("PATCH", path, payload, nullptr);
}

// -------------------- Sensors & connectivity --------------------
float readDistanceRawCm(int trigPin, int echoPin) {
  digitalWrite(trigPin, LOW);
  delayMicroseconds(2);
  digitalWrite(trigPin, HIGH);
  delayMicroseconds(10);
  digitalWrite(trigPin, LOW);

  long duration = pulseIn(echoPin, HIGH, ECHO_TIMEOUT_US);
  if (duration <= 0) {
    return NAN;
  }
  return (duration * 0.0343f) / 2.0f;
}

float sanitizeDistance(float distanceCm) {
  if (isnan(distanceCm) || distanceCm <= 0.0f || distanceCm > MAX_VALID_DISTANCE_CM) {
    return INVALID_DISTANCE_CM;
  }
  return distanceCm;
}

void sortArray(float* values, uint8_t count) {
  for (uint8_t i = 0; i < count; i++) {
    for (uint8_t j = i + 1; j < count; j++) {
      if (values[j] < values[i]) {
        float tmp = values[i];
        values[i] = values[j];
        values[j] = tmp;
      }
    }
  }
}

float readDistanceMedianCm(int trigPin, int echoPin, uint8_t sampleCount) {
  float samples[7];
  if (sampleCount > 7) sampleCount = 7;

  for (uint8_t i = 0; i < sampleCount; i++) {
    samples[i] = sanitizeDistance(readDistanceRawCm(trigPin, echoPin));
    delay(5);
  }
  sortArray(samples, sampleCount);
  return samples[sampleCount / 2];
}

void connectWifi() {
  if (isWifiConnected()) return;

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.persistent(false);
  Serial.printf("[WIFI] conectando a %s\n", WIFI_SSID);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long startAt = millis();
  while (!isWifiConnected() && (millis() - startAt) < 15000) {
    delay(300);
  }

  if (isWifiConnected()) {
    String ip = WiFi.localIP().toString();
    Serial.printf("[WIFI] conectado ip=%s rssi=%ld\n", ip.c_str(), WiFi.RSSI());
  } else {
    Serial.printf("[WIFI] conexion fallida status=%d\n", static_cast<int>(WiFi.status()));
  }
}

void syncNtp() {
  if (!ENABLE_NTP_SYNC) return;
  if (!isWifiConnected()) return;

  configTime(0, 0, "pool.ntp.org", "time.nist.gov");

  unsigned long startAt = millis();
  while ((time(nullptr) < 1700000000) && (millis() - startAt < 5000)) {
    delay(250);
  }
  lastNtpSyncAt = millis();
}

// -------------------- Barrier state & event flow --------------------
void writeBarrierSnapshot(const char* actor, const char* reason) {
  StaticJsonDocument<640> doc;
  doc["status"] = barrierStatus;
  doc["mode"] = barrierMode;
  doc["lastActionAt"] = nowIsoUtc();
  doc["lastActionEpochMs"] = nowEpochMs();
  JsonObject lastActionAtServer = doc.createNestedObject("lastActionAtServer");
  lastActionAtServer[".sv"] = "timestamp";
  doc["lastActionBy"] = actor;
  doc["reason"] = reason;
  doc["crossingDirection"] = directionToString(crossingDirection);
  doc["crossingState"] = sequenceStateToString(crossingState);

  String payload;
  serializeJson(doc, payload);
  firebasePatch(String("barrier/") + ACCESS_POINT, payload);
}

void openBarrier(const char* actor, const char* reason) {
  if (barrierStatus == "abierta") {
    logServoFlow("open skipped (already open)", actor, reason);
    return;
  }
  logServoFlow("open start", actor, reason);
  moveServoToAngle(SERVO_OPEN_ANGLE);
  barrierStatus = "abierta";
  barrierOpenedAtMs = millis();
  logServoFlow("open done", actor, reason);
  writeBarrierSnapshot(actor, reason);
}

void closeBarrier(const char* actor, const char* reason) {
  if (barrierStatus == "cerrada") {
    logServoFlow("close skipped (already closed)", actor, reason);
    return;
  }
  if (entryActive || exitActive) {
    logServoFlow("close blocked (sensor active)", actor, reason);
    return;
  }
  logServoFlow("close start", actor, reason);
  moveServoToAngle(SERVO_CLOSED_ANGLE);
  barrierStatus = "cerrada";
  logServoFlow("close done", actor, reason);
  writeBarrierSnapshot(actor, reason);
}

void forceToggleBarrier(const char* actor, const char* reason) {
  if (barrierStatus == "abierta") {
    logServoFlow("force close start", actor, reason);
    moveServoToAngle(SERVO_CLOSED_ANGLE);
    barrierStatus = "cerrada";
    barrierOpenedAtMs = 0;
    logServoFlow("force close done", actor, reason);
    writeBarrierSnapshot(actor, reason);
    return;
  }

  logServoFlow("force open start", actor, reason);
  moveServoToAngle(SERVO_OPEN_ANGLE);
  barrierStatus = "abierta";
  barrierOpenedAtMs = millis();
  logServoFlow("force open done", actor, reason);
  writeBarrierSnapshot(actor, reason);
}

void ackCommand(const String& requestId, const char* status, const char* message) {
  StaticJsonDocument<384> doc;
  doc["requestId"] = requestId;
  doc["status"] = status;
  doc["message"] = message;
  doc["processedAt"] = nowIsoUtc();
  doc["processedAtEpochMs"] = nowEpochMs();
  JsonObject processedAtServer = doc.createNestedObject("processedAtServer");
  processedAtServer[".sv"] = "timestamp";

  String payload;
  serializeJson(doc, payload);
  firebasePatch(String("devices/") + DEVICE_ID + "/lastCommandAck", payload);
}

void queueDetectionEvent(const char* trigger, const char* directionHint) {
  if (detectionQueue.pending) return;

  String eventId = String(DEVICE_ID) + "-" + String(millis()) + "-" + String(static_cast<uint32_t>(esp_random()), HEX);

  StaticJsonDocument<768> doc;
  doc["deviceId"] = DEVICE_ID;
  doc["accessPoint"] = ACCESS_POINT;
  doc["capturedAt"] = nowIsoUtc();
  doc["capturedAtEpochMs"] = nowEpochMs();
  JsonObject capturedAtServer = doc.createNestedObject("capturedAtServer");
  capturedAtServer[".sv"] = "timestamp";
  doc["trigger"] = trigger;
  doc["directionHint"] = directionHint;
  doc["entryDistanceCm"] = entryDistanceCm;
  doc["exitDistanceCm"] = exitDistanceCm;
  doc["entrySensorActive"] = entryActive;
  doc["exitSensorActive"] = exitActive;
  doc["mode"] = barrierMode;
  doc["requiresAuthorization"] = true;
  doc["firmware"] = FIRMWARE_VERSION;

  String payload;
  serializeJson(doc, payload);

  detectionQueue.pending = true;
  detectionQueue.eventId = eventId;
  detectionQueue.payload = payload;
  detectionQueue.attempts = 0;
  detectionQueue.nextRetryAt = millis();
}

void clearDetectionQueue() {
  detectionQueue.pending = false;
  detectionQueue.eventId = "";
  detectionQueue.payload = "";
  detectionQueue.attempts = 0;
  detectionQueue.nextRetryAt = 0;
}

void flushDetectionQueue() {
  if (!detectionQueue.pending) return;
  if (millis() < detectionQueue.nextRetryAt) return;
  if (!isWifiConnected()) return;

