Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
  bool ok = firebasePut(String("ingest/detections/") + detectionQueue.eventId, detectionQueue.payload);
  if (ok) {
    clearDetectionQueue();
    return;
  }

  detectionQueue.attempts++;
  if (detectionQueue.attempts >= MAX_RETRY_ATTEMPTS) {
    clearDetectionQueue();
    return;
  }
  detectionQueue.nextRetryAt = millis() + (RETRY_BASE_MS * detectionQueue.attempts);
}

void clearPlateReadingQueue() {
  plateReadingQueue.pending = false;
  plateReadingQueue.eventId = "";
  plateReadingQueue.payload = "";
  plateReadingQueue.attempts = 0;
  plateReadingQueue.nextRetryAt = 0;
}

void flushPlateReadingQueue() {
  if (!plateReadingQueue.pending) return;
  if (millis() < plateReadingQueue.nextRetryAt) return;
  if (!isWifiConnected()) return;

  int dbStatusCode = -1;
  String dbResponse;
  bool ok = firebaseRequest(
    "PUT",
    String("ingest/plate_readings/") + plateReadingQueue.eventId,
    plateReadingQueue.payload,
    &dbResponse,
    &dbStatusCode
  );

  if (ok) {
    Serial.printf("[PLATE] guardado en Realtime DB (path=ingest/plate_readings/%s)\n",
                  plateReadingQueue.eventId.c_str());
    clearPlateReadingQueue();
    return;
  }

  plateReadingQueue.attempts++;
  Serial.printf("[PLATE] no se pudo guardar en Realtime DB (path=ingest/plate_readings/%s http=%d body=%s attempt=%u)\n",
                plateReadingQueue.eventId.c_str(),
                dbStatusCode,
                clipForStorage(dbResponse, MAX_FIREBASE_ERROR_BODY_LOG).c_str(),
                plateReadingQueue.attempts);

  if (dbStatusCode == 401 || dbStatusCode == 403 || dbResponse.indexOf("PERMISSION_DENIED") >= 0) {
    Serial.println("[PLATE] revisar RTDB rules/claims para permitir escritura en ingest/plate_readings");
  }

  if (plateReadingQueue.attempts >= MAX_RETRY_ATTEMPTS) {
    Serial.printf("[PLATE] descartado por max retries id=%s\n", plateReadingQueue.eventId.c_str());
    clearPlateReadingQueue();
    return;
  }

  plateReadingQueue.nextRetryAt = millis() + (RETRY_BASE_MS * plateReadingQueue.attempts);
}

// -------------------- Passage state machine --------------------
void resetCrossingSequence() {
  crossingDirection = DIR_NONE;
  crossingState = SEQ_IDLE;
  crossingStateStartedAt = millis();
}

void onCrossingCompleted(PassageDirection dir) {
  if (barrierMode == "automatico" && barrierStatus == "abierta") {
    if (dir == DIR_INGRESO) {
      closeBarrier("automatico", "Secuencia de ingreso completada");
    } else if (dir == DIR_SALIDA) {
      closeBarrier("automatico", "Secuencia de salida completada");
    }
  }
}

void updateCrossingSequence() {
  unsigned long nowMs = millis();

  if (crossingState != SEQ_IDLE && (nowMs - crossingStateStartedAt > CROSSING_TIMEOUT_MS)) {
    resetCrossingSequence();
  }

  if (crossingState == SEQ_IDLE) {
    if (entryActive && !exitActive) {
      crossingDirection = DIR_INGRESO;
      crossingState = SEQ_FIRST_ACTIVE;
      crossingStateStartedAt = nowMs;
      return;
    }
    if (exitActive && !entryActive) {
      crossingDirection = DIR_SALIDA;
      crossingState = SEQ_FIRST_ACTIVE;
      crossingStateStartedAt = nowMs;
      return;
    }
    return;
  }

  if (crossingState == SEQ_FIRST_ACTIVE) {
    if (crossingDirection == DIR_INGRESO) {
      if (entryActive && exitActive) {
        crossingState = SEQ_BOTH_ACTIVE;
        crossingStateStartedAt = nowMs;
      } else if (!entryActive && !exitActive) {
        resetCrossingSequence();
      }
      return;
    }

    if (crossingDirection == DIR_SALIDA) {
      if (exitActive && entryActive) {
        crossingState = SEQ_BOTH_ACTIVE;
        crossingStateStartedAt = nowMs;
      } else if (!entryActive && !exitActive) {
        resetCrossingSequence();
      }
      return;
    }
  }

  if (crossingState == SEQ_BOTH_ACTIVE) {
    if (crossingDirection == DIR_INGRESO) {
      if (!entryActive && exitActive) {
        crossingState = SEQ_FIRST_RELEASED;
        crossingStateStartedAt = nowMs;
      } else if (!entryActive && !exitActive) {
        resetCrossingSequence();
      }
      return;
    }

    if (crossingDirection == DIR_SALIDA) {
      if (!exitActive && entryActive) {
        crossingState = SEQ_FIRST_RELEASED;
        crossingStateStartedAt = nowMs;
      } else if (!entryActive && !exitActive) {
        resetCrossingSequence();
      }
      return;
    }
  }

  if (crossingState == SEQ_FIRST_RELEASED) {
    if (!entryActive && !exitActive) {
      PassageDirection completed = crossingDirection;
      resetCrossingSequence();
      onCrossingCompleted(completed);
    }
  }
}

// -------------------- Inputs, commands, and control --------------------
void updateSensorsAndEvents() {
  entryDistanceCm = readDistanceMedianCm(PIN_ENTRY_TRIG, PIN_ENTRY_ECHO, SENSOR_SAMPLES);

  entryActive = (entryDistanceCm <= ENTRY_THRESHOLD_CM);
  if (HAS_EXIT_SENSOR) {
    exitDistanceCm = readDistanceMedianCm(PIN_EXIT_TRIG, PIN_EXIT_ECHO, SENSOR_SAMPLES);
    exitActive = (exitDistanceCm <= EXIT_THRESHOLD_CM);
  } else {
    exitDistanceCm = INVALID_DISTANCE_CM;
    exitActive = false;
  }

  if (DEBUG_DISTANCE_LOG && (millis() - lastDistanceLogAt >= DEBUG_DISTANCE_LOG_MS)) {
    Serial.printf("Dist entrada=%.1fcm act=%d\n",
                  entryDistanceCm, entryActive ? 1 : 0);
    lastDistanceLogAt = millis();
  }

  if (!prevEntryActive && entryActive) {
    queueDetectionEvent("entry_rising_edge", "ingreso");
    capturePhoto("entry_rising_edge");
  }
  if (HAS_EXIT_SENSOR && !prevExitActive && exitActive) {
    queueDetectionEvent("exit_rising_edge", "salida");
    capturePhoto("exit_rising_edge");
  }

  prevEntryActive = entryActive;
  if (HAS_EXIT_SENSOR) {
    prevExitActive = exitActive;
    updateCrossingSequence();
  } else {
    prevExitActive = false;
    resetCrossingSequence();
  }
}

void processManualButton() {
  int reading = digitalRead(PIN_MANUAL_BUTTON);
  if (reading != buttonLastReading) {
    buttonLastDebounceAt = millis();
  }

  if ((millis() - buttonLastDebounceAt) > BUTTON_DEBOUNCE_MS) {
    if (buttonStableState == HIGH && reading == LOW) {
      Serial.println("[SERVO] physical button press -> toggle open/close");
      if (barrierMode != "manual_fisico") {
        Serial.printf("[SERVO] forcing mode to manual_fisico from %s\n", barrierMode.c_str());
        barrierMode = "manual_fisico";
        writeBarrierSnapshot("manual_fisico_forzado", "Physical button forced manual mode");
      }
      forceToggleBarrier("manual_fisico_forzado", "Physical button forced actuation");

      // Evita reapertura inmediata si quedo una ventana remota activa.
      firebasePatch(String("commands/") + ACCESS_POINT, "{\"action\":\"none\",\"autoOpenUntil\":0}");
    }
    buttonStableState = reading;
  }
  buttonLastReading = reading;
}

