Thanatozz/stunning-logigate/firmware/esp32_gate_controller/esp32_gate_controller copy.ino
void pollCommands() {
  String response;
  if (!firebaseGet(String("commands/") + ACCESS_POINT, response)) {
    return;
  }
  if (response == "null" || response.length() == 0) {
    return;
  }

  StaticJsonDocument<512> doc;
  if (deserializeJson(doc, response) != DeserializationError::Ok) {
    return;
  }

  String mode = doc["mode"] | barrierMode;
  String action = doc["action"] | "none";
  String requestId = doc["requestId"] | "";
  long long autoOpenUntil = doc["autoOpenUntil"] | 0LL;

  if (mode != barrierMode) {
    Serial.printf("[CMD] mode change: %s -> %s\n", barrierMode.c_str(), mode.c_str());
    barrierMode = mode;
    writeBarrierSnapshot("dashboard", "Mode updated from command node");
  }

  if (requestId.length() > 0 && requestId != lastCommandRequestId) {
    Serial.printf("[CMD] requestId=%s action=%s mode=%s\n",
                  requestId.c_str(),
                  action.c_str(),
                  barrierMode.c_str());
    if (action == "abrir") {
      openBarrier("manual_remoto", "Open command from dashboard");
      ackCommand(requestId, "ok", "Barrier opened");
    } else if (action == "cerrar") {
      if (entryActive || exitActive) {
        ackCommand(requestId, "rejected", "Passage sensors active");
      } else {
        closeBarrier("manual_remoto", "Close command from dashboard");
        ackCommand(requestId, "ok", "Barrier closed");
      }
    } else {
      ackCommand(requestId, "ignored", "No actionable command");
    }

    if (action != "none") {
      firebasePatch(String("commands/") + ACCESS_POINT, "{\"action\":\"none\"}");
    }
    lastCommandRequestId = requestId;
  }

  if (barrierMode == "automatico" && autoOpenUntil > 0) {
    long long nowMs = nowEpochMs();
    if (nowMs > 0 && nowMs <= autoOpenUntil) {
      Serial.printf("[CMD] auto-open window active (now=%lld <= until=%lld)\n", nowMs, autoOpenUntil);
      openBarrier("automatico", "Authorized auto-open window");
    }
  }
}

void applyAutomaticClosureRule() {
  if (barrierMode != "automatico") return;
  if (barrierStatus != "abierta") return;
  if (entryActive || exitActive) return;

  if (millis() - barrierOpenedAtMs >= OPEN_FAILSAFE_MS) {
    Serial.println("[SERVO] failsafe close timeout reached");
    closeBarrier("automatico", "Failsafe close timeout");
  }
}

void publishHeartbeat(bool force) {
  if (!force && millis() - lastHeartbeatAt < HEARTBEAT_MS) return;
  if (!isWifiConnected()) return;

  StaticJsonDocument<1024> doc;
  doc["name"] = DEVICE_NAME;
  doc["type"] = "esp32_cam";
  doc["accessPoint"] = ACCESS_POINT;
  doc["status"] = "online";
  doc["mode"] = barrierMode;
  doc["signal"] = wifiSignalPercent();
  doc["firmware"] = FIRMWARE_VERSION;
  doc["lastSeen"] = nowIsoUtc();
  doc["lastSeenEpochMs"] = nowEpochMs();
  JsonObject lastSeenServer = doc.createNestedObject("lastSeenServer");
  lastSeenServer[".sv"] = "timestamp";

  JsonObject telemetry = doc.createNestedObject("telemetry");
  telemetry["entryDistanceCm"] = entryDistanceCm;
  telemetry["exitDistanceCm"] = exitDistanceCm;
  telemetry["entrySensorActive"] = entryActive;
  telemetry["exitSensorActive"] = exitActive;
  telemetry["crossingDirection"] = directionToString(crossingDirection);
  telemetry["crossingState"] = sequenceStateToString(crossingState);
  telemetry["barrierStatus"] = barrierStatus;
  telemetry["uptimeMs"] = millis();

  String payload;
  serializeJson(doc, payload);
  firebasePatch(String("devices/") + DEVICE_ID, payload);
  lastHeartbeatAt = millis();
}

// -------------------- Lifecycle tasks --------------------
void setupHardware() {
  pinMode(PIN_ENTRY_TRIG, OUTPUT);
  pinMode(PIN_ENTRY_ECHO, INPUT);

  if (HAS_EXIT_SENSOR) {
    pinMode(PIN_EXIT_TRIG, OUTPUT);
    pinMode(PIN_EXIT_ECHO, INPUT);
  }

  pinMode(PIN_MANUAL_BUTTON, INPUT_PULLUP);

  barrierServo.setPeriodHertz(50);
  barrierServo.attach(PIN_SERVO);
  barrierServo.write(SERVO_CLOSED_ANGLE);
  servoCurrentAngle = SERVO_CLOSED_ANGLE;
  delay(SERVO_SETTLE_MS);
  if (SERVO_DETACH_WHEN_IDLE) {
    barrierServo.detach();
  }

  barrierStatus = "cerrada";
  barrierOpenedAtMs = 0;
  resetCrossingSequence();
}

void setupConnectivityAndAuth() {
  connectWifi();
  if (!isWifiConnected()) return;

  setupPreviewServerIfNeeded();
  syncNtp();
  ensureFirebaseIdToken();
}

void runConnectivityTask() {
  if (millis() - lastWifiCheckAt < WIFI_RECONNECT_MS) return;

  if (!isWifiConnected()) {
    connectWifi();
  }

  if (isWifiConnected()) {
    setupPreviewServerIfNeeded();
  }

  if (ENABLE_NTP_SYNC && isWifiConnected() && (millis() - lastNtpSyncAt > 3600000)) {
    syncNtp();
  }

  lastWifiCheckAt = millis();
}

void runSensorTask() {
  if (millis() - lastSensorPollAt < SENSOR_POLL_MS) return;
  updateSensorsAndEvents();
  lastSensorPollAt = millis();
}

void runCommandTask() {
  if (millis() - lastCommandPollAt < COMMAND_POLL_MS) return;
  pollCommands();
  lastCommandPollAt = millis();
}

void setup() {
  Serial.begin(115200);
  randomSeed(esp_random());
  cameraReady = initCamera();

  setupHardware();
  setupConnectivityAndAuth();

  writeBarrierSnapshot("boot", "Device startup");
  publishHeartbeat(true);
}

void loop() {
  runConnectivityTask();
  runPreviewServerTask();

  processManualButton();

  runSensorTask();

  flushDetectionQueue();
  flushPlateReadingQueue();

  runCommandTask();

  applyAutomaticClosureRule();
  publishHeartbeat(false);
}
